# Radius Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Arc..::..Radius Property
Arc Class See Also
---
Returns the radius of the arc.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public double Radius { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Radius As Double
	Get
```

Visual C++
---
```text
public:
property double Radius {
	double get ();
}
```

# See Also
Arc Class
Autodesk.Revit.DB Namespace